app/controllers/bugs_controller.rb

SELECT  "bugs".* FROM "bugs" WHERE "bugs"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    @bug = Bug.find(params[:id])

SELECT "bugs".* FROM "bugs"
SELECT "logs".* FROM "logs"
---
  def index
    @bugs = Bug.all

    @logs = Log.all

INSERT INTO "bugs" ("name", "precedense", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "YO"], ["precedense", "PENIS"], ["description", "PENIC"], ["created_at", "2015-04-06 01:27:50.524688"], ["updated_at", "2015-04-06 01:27:50.524688"]]
INSERT INTO "logs" ("a_log", "created_at", "updated_at") VALUES (?, ?, ?)  [["a_log", "Jonathan created Bug ID: 6 at "], ["created_at", "2015-04-07 16:01:48.173254"], ["updated_at", "2015-04-07 16:01:48.173254"]]
---
  def create #taken from the POST form method of new.html
    @bug = Bug.new(bug_params)
    if @bug.save #handle a successful save

    #add log entry for 'create' and save
    @log_entry = Log.new

    time1 = Time.new.to_s
    @log_entry.a_log = time1 + "| " + current_user.name + " created Bug ID: " + @bug.id.to_s
    @log_entry.save

SELECT  "bugs".* FROM "bugs" WHERE "bugs"."id" = ? LIMIT 1  [["id", 4]]
---
  def edit
    @bug = Bug.find(params[:id])

SELECT  "bugs".* FROM "bugs" WHERE "bugs"."id" = ? LIMIT 1  [["id", 3]]
UPDATE "bugs" SET "precedense" = ?, "description" = ?, "updated_at" = ? WHERE "bugs"."id" = ?  [["precedense", "low"], ["description", "changed"], ["updated_at", "2015-04-07 19:31:58.373721"], ["id", 20]]
INSERT INTO "logs" ("a_log", "created_at", "updated_at") VALUES (?, ?, ?)  [["a_log", "2015-04-07 16:34:23 +0000| Jonathan updated Bug ID: 3 CHANGED: PRECEDENSE: [LOW -> LOW] "], ["created_at", "2015-04-07 16:34:23.124481"], ["updated_at", "2015-04-07 16:34:23.124481"]]
---
  def update
    @bug = Bug.find(params[:id])

    #Store 'past state' bug information here
    @past_bug = @bug.dup
    changed_states = ""

    if @bug.update_attributes(bug_params)
      # Handle a successful update.

      if @bug.name != @past_bug.name
      changed_states += "NAME: [" + @past_bug.name + " -> " + @bug.name + "] "
      end
      if @bug.description != @past_bug.description
      changed_states += " [updated description] "
      end
      if @bug.precedense != @past_bug.precedense
      changed_states += "PRECEDENSE: [" + @past_bug.precedense + " -> " + @bug.precedense + "] "
      end

    #add log entry for 'update' and save
    @log_entry = Log.new
    time1 = Time.new.to_s
    @log_entry.a_log = time1 + "| " + current_user.name + " updated Bug ID: " + @bug.id.to_s + " CHANGED: " + changed_states
    @log_entry.save

SELECT  "bugs".* FROM "bugs" WHERE "bugs"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "logs" ("a_log", "created_at", "updated_at") VALUES (?, ?, ?)  [["a_log", "2015-04-08 16:58:12 +0000| hello deleted Bug ID: 4"], ["created_at", "2015-04-08 16:58:12.172211"], ["updated_at", "2015-04-08 16:58:12.172211"]]
DELETE FROM "bugs" WHERE "bugs"."id" = ?  [["id", 1]]
---
  def destroy
    @bug = Bug.find(params[:id])

    @log_entry = Log.new
    time1 = Time.new.to_s
    @log_entry.a_log = time1 + "| " + current_user.name + " deleted Bug ID: " + @bug.id.to_s
    @log_entry.save


    @bug.destroy

SELECT  "bugs".* FROM "bugs" WHERE "bugs"."id" = ? LIMIT 1  [["id", 5]]
UPDATE "bugs" SET "done" = ?, "updated_at" = ? WHERE "bugs"."id" = ?  [["done", "t"], ["updated_at", "2015-04-08 19:58:38.750984"], ["id", 5]]
---
  def close

    @bug = Bug.find(params[:id])
    @bug.done = true
    @bug.save